MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX764F128H.atdf
      <value-group caption="RMII Speed bit" name="EMAC1SUPP__SPEEDRMII">
         <value caption="RMII is running at 100 Mbps" name="" value="0x1" />
         <value caption="RMII is running at 10 Mbps" name="" value="0x0" />
      </value-group>
      <value-group caption="Reset RMII Logic bit" name="EMAC1SUPP__RESETRMII">
         <value caption="Reset the MAC RMII module" name="" value="0x1" />
         <value caption="Normal operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Shortcut PAUSE Quanta bit" name="EMAC1TEST__SHRTQNTA">
         <value caption="The MAC reduces the effective PAUSE Quanta from 64 byte-times to 1 byte-time" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test PAUSE bit" name="EMAC1TEST__TESTPAUSE">
         <value caption="The MAC Control sub-layer will inhibit transmissions" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test Backpressure bit" name="EMAC1TEST__TESTBP">
         <value caption="The MAC will assert backpressure on the link. Backpressure causes preamble to be transmitted" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Increment bit" name="EMAC1MCFG__SCANINC">
         <value caption="The MII Management module will perform read cycles across a range of PHYs. The read cycles will start from address 1 through the value set in EMAC1MADR" name="" value="0x1" />
         <value caption="Continuous reads of the same PHY" name="" value="0x0" />
      </value-group>
      <value-group caption="Suppress Preamble bit" name="EMAC1MCFG__NOPRE">
         <value caption="The MII Management will perform read/write cycles without the 32-bit preamble field. Some PHYs support suppressed preamble" name="" value="0x1" />
         <value caption="Normal read/write cycles are performed" name="" value="0x0" />
      </value-group>
      <value-group caption="Test Reset MII Management bit" name="EMAC1MCFG__RESETMGMT">
         <value caption="Reset the MII Management module" name="" value="0x1" />
         <value caption="Normal Operation" name="" value="0x0" />
      </value-group>
      <value-group caption="MII Management Read Command bit" name="EMAC1MCMD__READ">
         <value caption="The MII Management module will perform a single read cycle. The read data is returned in the EMAC1MRDD register" name="" value="0x1" />
         <value caption="The MII Management module will perform a write cycle. The write data is taken from the EMAC1MWTD register" name="" value="0x0" />
      </value-group>
      <value-group caption="MII Management Scan Mode bit" name="EMAC1MCMD__SCAN">
         <value caption="The MII Management module will perform read cycles continuously (for example" name="" value="0x1" />
         <value caption="Normal Operation" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00774" name="I2C" version="1">
      <register-group name="I2C">
         <register caption="I2C Control Register" name="I2C3CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C3CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C3CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C3CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C3CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C3CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C3CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C3CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C3CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C3CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C3CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C3CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C3CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C3CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C3CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C3CON__ON" />
         </register>
         <register caption="I2C Control Register" name="I2C4CON" offset="0x100" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C4CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C4CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C4CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C4CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C4CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C4CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C4CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C4CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C4CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C4CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C4CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C4CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C4CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C4CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C4CON__ON" />
         </register>
         <register caption="I2C Control Register" name="I2C5CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C5CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C5CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C5CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C5CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C5CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C5CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C5CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C5CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C5CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C5CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C5CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C5CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C5CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C5CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C5CON__ON" />
         </register>
         <register caption="I2C Control Register" name="I2C1CON" offset="0x300" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
         </register>
         <register caption="I2C Status Register" name="I2C3STAT" offset="0x10" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C3STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C3STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C3STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C3STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C3STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C3STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C3STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C3STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C3STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C3STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C3STAT__BCL" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C3STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C3STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C4STAT" offset="0x110" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C4STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C4STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C4STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C4STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C4STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C4STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C4STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C4STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C4STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C4STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C4STAT__BCL" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C4STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C4STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C5STAT" offset="0x210" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C5STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C5STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C5STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C5STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C5STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C5STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C5STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C5STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C5STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C5STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C5STAT__BCL" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C5STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C5STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C1STAT" offset="0x310" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C1STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C1STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C1STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C1STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C1STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C1STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C1STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C1STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C1STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C1STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C1STAT__BCL" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C1STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C1STAT__ACKSTAT" />
         </register>
         <register caption="" name="I2C3ADD" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
