MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX764F128H.atdf
         <register caption="" name="I2C4ADD" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C5ADD" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C1ADD" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C3MSK" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C4MSK" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C5MSK" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C1MSK" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C3BRG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C4BRG" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C5BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C1BRG" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C3TRN" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C4TRN" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C5TRN" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C1TRN" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C3RCV" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C4RCV" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C5RCV" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C1RCV" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
      </register-group>
      <value-group caption="Start Condition Enable bit (when operating as I2C master)" name="I2C3CON__SEN">
         <value caption="Initiate Start condition on SDAx and SCLx pins. Hardware clear at end of master Start sequence." name="" value="0x1" />
         <value caption="Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Repeated Start Condition Enable bit (when operating as I2C master)" name="I2C3CON__RSEN">
         <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1" />
         <value caption="Repeated Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Condition Enable bit (when operating as I2C master)" name="I2C3CON__PEN">
         <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1" />
         <value caption="Stop condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Enable bit (when operating as I2C master)" name="I2C3CON__RCEN">
         <value caption="Enables Receive mode for I2C. Hardware clear at end of eighth bit of master receive data byte." name="" value="0x1" />
         <value caption="Receive sequence not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Sequence Enable bit" name="I2C3CON__ACKEN">
         <value caption="Initiate Acknowledge sequence on SDAx and SCLx pins and transmit ACKDT data bit. Hardware clear at end of master Acknowledge sequence." name="" value="0x1" />
         <value caption="Acknowledge sequence not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" name="I2C3CON__ACKDT">
         <value caption="Send NACK during Acknowledge" name="" value="0x1" />
         <value caption="Send ACK during Acknowledge" name="" value="0x0" />
      </value-group>
      <value-group caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" name="I2C3CON__STREN">
         <value caption="Enable software or receive clock stretching" name="" value="0x1" />
         <value caption="Disable software or receive clock stretching" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Enable bit (when operating as I2C slave)" name="I2C3CON__GCEN">
         <value caption="Enable interrupt when a general call address is received in the I2CxRSR(module is enabled for reception)" name="" value="0x1" />
         <value caption="General call address disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SMBus Input Levels bit" name="I2C3CON__SMEN">
         <value caption="Enable I/O pin thresholds compliant with SMBus specification" name="" value="0x1" />
         <value caption="Disable SMBus input thresholds" name="" value="0x0" />
      </value-group>
