MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX764F128H.atdf
      <value-group caption="Write Strobe Polarity bit" name="PMCON__WRSP">
         <value caption="(Slave and Master mode 2) Write strobe active-high / (Master mode 1) Enable strobe active-high" name="" value="0x1" />
         <value caption="(Slave and Master mode 2) Write strobe active-low / (Master mode 1) Enable strobe active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 Polarity bit" name="PMCON__CS1P">
         <value caption="Active-high (PMCS1)" name="" value="0x1" />
         <value caption="Active-low (PMCS1)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 Polarity bit" name="PMCON__CS2P">
         <value caption="Active-high (PMCS2)" name="" value="0x1" />
         <value caption="Active-low (PMCS2)" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Latch Polarity bit" name="PMCON__ALP">
         <value caption="Active-high (PMALL and PMALH)" name="" value="0x1" />
         <value caption="Active-low (PMALL and PMALH)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select Function bits" name="PMCON__CSF">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="PMCS2 and PMCS1 function as Chip Select" name="" value="0x2" />
         <value caption="PMCS2 functions as Chip Select, PMCS1 functions as address bit 14" name="" value="0x1" />
         <value caption="PMCS2 and PMCS1 function as address bits 15 and 14" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Strobe Port Enable bit" name="PMCON__PTRDEN">
         <value caption="PMRD/PMWR port is enabled" name="" value="0x1" />
         <value caption="PMRD/PMWR port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable Strobe Port Enable bit" name="PMCON__PTWREN">
         <value caption="PMWR/PMENB port is enabled" name="" value="0x1" />
         <value caption="PMWR/PMENB port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PMP Module TTL Input Buffer Select bit" name="PMCON__PMPTTL">
         <value caption="PMP module uses TTL input buffers" name="" value="0x1" />
         <value caption="PMP module uses Schmitt Trigger input buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Address/Data Multiplexing Selection bits" name="PMCON__ADRMUX">
         <value caption="All 16 bits of address are multiplexed on PMD(15:0) pins" name="" value="0x3" />
         <value caption="All 16 bits of address are multiplexed on PMD(7:0) pins" name="" value="0x2" />
         <value caption="Lower 8 bits of address are multiplexed on PMD(7:0) pins, upper bits are on PMA(15:8)" name="" value="0x1" />
         <value caption="Address and data appear on separate pins" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="PMCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Master Port Enable bit" name="PMCON__ON">
         <value caption="PMP is enabled" name="" value="0x1" />
         <value caption="PMP is disabled, no off-chip access performed" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Hold After Read/Write Strobe Wait States bits" name="PMMODE__WAITE">
         <value caption="(for write operations) Wait of 4 TPB / (for read operations) Wait of 3 TPB" name="" value="0x3" />
         <value caption="(for write operations) Wait of 3 TPB / (for read operations) Wait of 2 TPB" name="" value="0x2" />
         <value caption="(for write operations) Wait of 2 TPB / (for read operations) Wait of 1 TPB" name="" value="0x1" />
         <value caption="(for write operations) Wait of 1 TPB (default) / (for read operations) Wait of 0 TPB (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Read/Write Strobe Wait States bits" name="PMMODE__WAITM">
         <value caption="Wait of 16TPB" name="" value="0xf" />
         <value caption="Wait of 15TPB" name="" value="0xe" />
         <value caption="Wait of 14TPB" name="" value="0xd" />
         <value caption="Wait of 13TPB" name="" value="0xc" />
         <value caption="Wait of 12TPB" name="" value="0xb" />
         <value caption="Wait of 11TPB" name="" value="0xa" />
         <value caption="Wait of 10TPB" name="" value="0x9" />
         <value caption="Wait of 9TPB" name="" value="0x8" />
         <value caption="Wait of 8TPB" name="" value="0x7" />
         <value caption="Wait of 7TPB" name="" value="0x6" />
         <value caption="Wait of 6TPB" name="" value="0x5" />
         <value caption="Wait of 5TPB" name="" value="0x4" />
         <value caption="Wait of 4TPB" name="" value="0x3" />
         <value caption="Wait of 3TPB" name="" value="0x2" />
         <value caption="Wait of 2TPB" name="" value="0x1" />
         <value caption="Wait of 1TPB (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Setup to Read/Write Strobe Wait States bits" name="PMMODE__WAITB">
         <value caption="Data wait of 4 TPB; multiplexed address phase of 4 TPB" name="" value="0x3" />
         <value caption="Data wait of 3 TPB; multiplexed address phase of 3 TPB" name="" value="0x2" />
         <value caption="Data wait of 2 TPB; multiplexed address phase of 2 TPB" name="" value="0x1" />
         <value caption="Data wait of 1 TPB; multiplexed address phase of 1 TPB (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Parallel Port Mode Select bits" name="PMMODE__MODE">
         <value caption="Master mode 1 (PMCS1, PMRD/PMWR, PMENB, PMA, and PMD)" name="" value="0x3" />
         <value caption="Master mode 2 (PMCS1, PMRD, PMWR, PMA, and PMD)" name="" value="0x2" />
         <value caption="Enhanced Slave mode (PMRD, PMWR, PMCS1, PMD, and PMA)" name="" value="0x1" />
         <value caption="Legacy Parallel Slave Port (PMRD, PMWR, PMCS1, and PMD)" name="" value="0x0" />
      </value-group>
